Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/children_s_health/school_health_services.html.txt.tmx
Source language: en
Languages: ga

source: The Health Service Executive (HSE) provides a school screening programme and a school immunisation programme for children attending public primary schools
ga: Cuireann Feidhmeannacht na Seirbhíse Sláinte (FSS) clár scagtha scoile agus clár imdhíonta scoile ar fáil do pháistí atá ag freastal ar bhunscoileanna poiblí

source: Private primary schools may request the service and the Health Service Executive has the discretion to extend the service to these schools
ga: Is féidir le bunscoileanna príobháideacha an tseirbhís a iarraidh agus is faoin FSS atá sé cinneadh a dhéanamh an tseirbhís seo a chur ar fáil sna scoileanna sin

source: School health screenings are conducted by public health nurses and area medical officers who are employed by the HSE
ga: Is iad na haltraí sláinte poiblí a chuireann an scagadh sláinte scoile ar fáil chomh maith le hoifigigh sláinte ceantair atá fostaithe ag an FSS

source: These screenings are carried out on the school premises and the school principal is told of the date of the screenings in advance so parents can be notified and parents are entitled to be present if they wish
ga: Déantar an scagadh seo i bhfoirgneamh na scoile agus cuirtear in iúl don phríomhoide cén dáta a bhfuil sé i gceist a bheith i láthair sa scoil ionas gur féidir scéal a chur chuig na tuismitheoirí agus is féidir leo a bheith i láthair más mian leo é

source: Children's hearing and vision are examined and where requested by the parent or deemed necessary, a physical examination may be carried out
ga: Déantar éisteacht agus amharc na bpáistí a scrúdú agus nuair a bhíonn sé iarrtha ag na tuismitheoirí nó má cheaptar go bhfuil gá leis is féidir scrúdú fisiceach a dhéanamh

source: Problems that are identified at these screenings are treated free of charge if the child attends as a public patient at an out-patient hospital departments
ga: Má aimsítear fadhbanna ag na scrúduithe seo cuirtear cóir leighis ar fáil dóibh saor in aisce má thagann an páiste mar othar poiblí chuig rannóg na n-othar seachtrach in ospidéal

source: Any subsequent treatment (whether out-patient or in-patient) arising from this initial referral is free of charge as a public patient
ga: Is féidir aon chóir leighis a bhaineann leis an gcéad chuairt ar an rannóg seachtrach (mar othar seachtrach nó cónaitheach) a fháil saor in aisce mar othar poiblí

source: School screening is arranged by the HSE in conjunction with the school principal
ga: Déanann Feidhmeannacht na Seirbhíse Sláinte (FSS) scagadh scoile a eagrú i gcomhair le príomhoide na scoile
